## Bonus (Optional)

As you examine the data, you begin to suspect that the dataset is fake. Maybe your boss gave you spurious data in order to test the data engineering skills of a new employee? To confirm your hunch, you decide to create a visualisation of the data to present to your boss. Follow these steps:

 Import the SQL database into Pandas Ref: magnimindacademy.com

In [1]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\victo\anaconda3\envs\pythondata\lib\site-packages (2.9.5)
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import create_engine

In [3]:
# Establish a connection to the database using the SQLAlchemy create_engine function
engine = create_engine(f"postgresql://postgres:postgres@localhost:5432/employee_db")
connection = engine.connect()

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
employees_df = pd.read_sql("select * from employees", connection)
employees_df.fillna("NaN")

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991
...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,10/28/1988
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988
300022,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987

In [6]:
salaries_df = pd.read_sql("select * from salaries", connection)
salaries_df

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [ ]:
plt.figure(figsize=(10,5))
bins = [40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000, 130000]
n, bins, patches = plt.hist(x=salaries_df["salary"], bins = bins, color = 'b', alpha=0.9, rwidth=0.85)
plt.grid(axis='y', alpha=0.75)
plt.xlabel('Salary Range')
plt.ylabel('Frequency')
plt.title('Most Common Salary Ranges')
plt.show()

In [ ]:
plt.hist(salaries_df, 5)
        
# bins = bin_group = [40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000, 130000]

plt.grid(axis='y', alpha=0.75)
plt.xlabel('Salary ($)')
plt.ylabel('Frequency')
plt.title('Most Common Salary Ranges')
plt.show()

In [ ]:
# Ref: https://magnimindacademy.com
%load_ext sql

In [ ]:
%sql $engine.url

In [ ]:
# most common salary ranges for employees
%sql SELECT emp_no, salary from salaries order by salary DESC limit 10

In [ ]:
%%sql SELECT emp_no, first_name, last_name 
from employees order by first_name LIMIT 10

In [ ]:
%%sql SELECT emp_no, salary 
from salaries order by salary ASC limit 10